/* automatically generated by rust-bindgen 0.65.1 */

pub const OQS_SIG_alg_dilithium_2: &[u8; 11usize] = b"Dilithium2\0";
pub const OQS_SIG_alg_dilithium_3: &[u8; 11usize] = b"Dilithium3\0";
pub const OQS_SIG_alg_dilithium_5: &[u8; 11usize] = b"Dilithium5\0";
pub const OQS_SIG_alg_falcon_512: &[u8; 11usize] = b"Falcon-512\0";
pub const OQS_SIG_alg_falcon_1024: &[u8; 12usize] = b"Falcon-1024\0";
pub const OQS_SIG_alg_sphincs_sha2_128f_simple: &[u8; 26usize] = b"SPHINCS+-SHA2-128f-simple\0";
pub const OQS_SIG_alg_sphincs_sha2_128s_simple: &[u8; 26usize] = b"SPHINCS+-SHA2-128s-simple\0";
pub const OQS_SIG_alg_sphincs_sha2_192f_simple: &[u8; 26usize] = b"SPHINCS+-SHA2-192f-simple\0";
pub const OQS_SIG_alg_sphincs_sha2_192s_simple: &[u8; 26usize] = b"SPHINCS+-SHA2-192s-simple\0";
pub const OQS_SIG_alg_sphincs_sha2_256f_simple: &[u8; 26usize] = b"SPHINCS+-SHA2-256f-simple\0";
pub const OQS_SIG_alg_sphincs_sha2_256s_simple: &[u8; 26usize] = b"SPHINCS+-SHA2-256s-simple\0";
pub const OQS_SIG_alg_sphincs_shake_128f_simple: &[u8; 27usize] = b"SPHINCS+-SHAKE-128f-simple\0";
pub const OQS_SIG_alg_sphincs_shake_128s_simple: &[u8; 27usize] = b"SPHINCS+-SHAKE-128s-simple\0";
pub const OQS_SIG_alg_sphincs_shake_192f_simple: &[u8; 27usize] = b"SPHINCS+-SHAKE-192f-simple\0";
pub const OQS_SIG_alg_sphincs_shake_192s_simple: &[u8; 27usize] = b"SPHINCS+-SHAKE-192s-simple\0";
pub const OQS_SIG_alg_sphincs_shake_256f_simple: &[u8; 27usize] = b"SPHINCS+-SHAKE-256f-simple\0";
pub const OQS_SIG_alg_sphincs_shake_256s_simple: &[u8; 27usize] = b"SPHINCS+-SHAKE-256s-simple\0";
pub const OQS_SIG_algs_length: u32 = 17;
pub const OQS_SIG_dilithium_2_length_public_key: u32 = 1312;
pub const OQS_SIG_dilithium_2_length_secret_key: u32 = 2528;
pub const OQS_SIG_dilithium_2_length_signature: u32 = 2420;
pub const OQS_SIG_dilithium_3_length_public_key: u32 = 1952;
pub const OQS_SIG_dilithium_3_length_secret_key: u32 = 4000;
pub const OQS_SIG_dilithium_3_length_signature: u32 = 3293;
pub const OQS_SIG_dilithium_5_length_public_key: u32 = 2592;
pub const OQS_SIG_dilithium_5_length_secret_key: u32 = 4864;
pub const OQS_SIG_dilithium_5_length_signature: u32 = 4595;
extern "C" {
    pub fn OQS_SIG_alg_identifier(i: usize) -> *const ::libc::c_char;
}
extern "C" {
    pub fn OQS_SIG_alg_count() -> ::libc::c_int;
}
extern "C" {
    pub fn OQS_SIG_alg_is_enabled(method_name: *const ::libc::c_char) -> ::libc::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OQS_SIG {
    pub method_name: *const ::libc::c_char,
    pub alg_version: *const ::libc::c_char,
    pub claimed_nist_level: u8,
    pub euf_cma: bool,
    pub length_public_key: usize,
    pub length_secret_key: usize,
    pub length_signature: usize,
    pub keypair: ::core::option::Option<
        unsafe extern "C" fn(public_key: *mut u8, secret_key: *mut u8) -> OQS_STATUS,
    >,
    pub sign: ::core::option::Option<
        unsafe extern "C" fn(
            signature: *mut u8,
            signature_len: *mut usize,
            message: *const u8,
            message_len: usize,
            secret_key: *const u8,
        ) -> OQS_STATUS,
    >,
    pub verify: ::core::option::Option<
        unsafe extern "C" fn(
            message: *const u8,
            message_len: usize,
            signature: *const u8,
            signature_len: usize,
            public_key: *const u8,
        ) -> OQS_STATUS,
    >,
}
#[test]
fn bindgen_test_layout_OQS_SIG() {
    const UNINIT: ::core::mem::MaybeUninit<OQS_SIG> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<OQS_SIG>(),
        72usize,
        concat!("Size of: ", stringify!(OQS_SIG))
    );
    assert_eq!(
        ::core::mem::align_of::<OQS_SIG>(),
        8usize,
        concat!("Alignment of ", stringify!(OQS_SIG))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).method_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OQS_SIG),
            "::",
            stringify!(method_name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).alg_version) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OQS_SIG),
            "::",
            stringify!(alg_version)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).claimed_nist_level) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(OQS_SIG),
            "::",
            stringify!(claimed_nist_level)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).euf_cma) as usize - ptr as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(OQS_SIG),
            "::",
            stringify!(euf_cma)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).length_public_key) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(OQS_SIG),
            "::",
            stringify!(length_public_key)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).length_secret_key) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(OQS_SIG),
            "::",
            stringify!(length_secret_key)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).length_signature) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(OQS_SIG),
            "::",
            stringify!(length_signature)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).keypair) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(OQS_SIG),
            "::",
            stringify!(keypair)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sign) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(OQS_SIG),
            "::",
            stringify!(sign)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).verify) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(OQS_SIG),
            "::",
            stringify!(verify)
        )
    );
}
extern "C" {
    pub fn OQS_SIG_new(method_name: *const ::libc::c_char) -> *mut OQS_SIG;
}
extern "C" {
    pub fn OQS_SIG_keypair(
        sig: *const OQS_SIG,
        public_key: *mut u8,
        secret_key: *mut u8,
    ) -> OQS_STATUS;
}
extern "C" {
    pub fn OQS_SIG_sign(
        sig: *const OQS_SIG,
        signature: *mut u8,
        signature_len: *mut usize,
        message: *const u8,
        message_len: usize,
        secret_key: *const u8,
    ) -> OQS_STATUS;
}
extern "C" {
    pub fn OQS_SIG_verify(
        sig: *const OQS_SIG,
        message: *const u8,
        message_len: usize,
        signature: *const u8,
        signature_len: usize,
        public_key: *const u8,
    ) -> OQS_STATUS;
}
extern "C" {
    pub fn OQS_SIG_free(sig: *mut OQS_SIG);
}
extern "C" {
    pub fn OQS_SIG_dilithium_2_new() -> *mut OQS_SIG;
}
extern "C" {
    pub fn OQS_SIG_dilithium_2_keypair(public_key: *mut u8, secret_key: *mut u8) -> OQS_STATUS;
}
extern "C" {
    pub fn OQS_SIG_dilithium_2_sign(
        signature: *mut u8,
        signature_len: *mut usize,
        message: *const u8,
        message_len: usize,
        secret_key: *const u8,
    ) -> OQS_STATUS;
}
extern "C" {
    pub fn OQS_SIG_dilithium_2_verify(
        message: *const u8,
        message_len: usize,
        signature: *const u8,
        signature_len: usize,
        public_key: *const u8,
    ) -> OQS_STATUS;
}
extern "C" {
    pub fn OQS_SIG_dilithium_3_new() -> *mut OQS_SIG;
}
extern "C" {
    pub fn OQS_SIG_dilithium_3_keypair(public_key: *mut u8, secret_key: *mut u8) -> OQS_STATUS;
}
extern "C" {
    pub fn OQS_SIG_dilithium_3_sign(
        signature: *mut u8,
        signature_len: *mut usize,
        message: *const u8,
        message_len: usize,
        secret_key: *const u8,
    ) -> OQS_STATUS;
}
extern "C" {
    pub fn OQS_SIG_dilithium_3_verify(
        message: *const u8,
        message_len: usize,
        signature: *const u8,
        signature_len: usize,
        public_key: *const u8,
    ) -> OQS_STATUS;
}
extern "C" {
    pub fn OQS_SIG_dilithium_5_new() -> *mut OQS_SIG;
}
extern "C" {
    pub fn OQS_SIG_dilithium_5_keypair(public_key: *mut u8, secret_key: *mut u8) -> OQS_STATUS;
}
extern "C" {
    pub fn OQS_SIG_dilithium_5_sign(
        signature: *mut u8,
        signature_len: *mut usize,
        message: *const u8,
        message_len: usize,
        secret_key: *const u8,
    ) -> OQS_STATUS;
}
extern "C" {
    pub fn OQS_SIG_dilithium_5_verify(
        message: *const u8,
        message_len: usize,
        signature: *const u8,
        signature_len: usize,
        public_key: *const u8,
    ) -> OQS_STATUS;
}
